{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Punctuation",
        "behavior": "Isolated"
      },
      {
        "type": "Split",
        "pattern": {
          "String": " "
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      " ": 3,
      "!": 4,
      "\"": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      ":": 13,
      ";": 14,
      "?": 15,
      "[": 16,
      "]": 17,
      "a": 18,
      "b": 19,
      "c": 20,
      "d": 21,
      "e": 22,
      "f": 23,
      "g": 24,
      "h": 25,
      "i": 26,
      "j": 27,
      "k": 28,
      "l": 29,
      "m": 30,
      "n": 31,
      "o": 32,
      "p": 33,
      "q": 34,
      "r": 35,
      "s": 36,
      "t": 37,
      "u": 38,
      "v": 39,
      "w": 40,
      "x": 41,
      "y": 42,
      "z": 43,
      "{": 44,
      "}": 45,
      "¯": 46,
      "æ": 47,
      "è": 48,
      "é": 49,
      "ê": 50,
      "ñ": 51,
      "ô": 52,
      "œ": 53,
      "—": 54,
      "th": 55,
      "the": 56,
      "in": 57,
      "an": 58,
      "er": 59,
      "re": 60,
      "ou": 61,
      "on": 62,
      "ed": 63,
      "at": 64,
      "en": 65,
      "to": 66,
      "and": 67,
      "is": 68,
      "as": 69,
      "of": 70,
      "ing": 71,
      "or": 72,
      "it": 73,
      "he": 74,
      "ar": 75,
      "es": 76,
      "ll": 77,
      "le": 78,
      "ha": 79,
      "se": 80,
      "st": 81,
      "wh": 82,
      "me": 83,
      "be": 84,
      "no": 85,
      "ch": 86,
      "ro": 87,
      "wi": 88,
      "al": 89,
      "you": 90,
      "was": 91,
      "id": 92,
      "ly": 93,
      "ld": 94,
      "ve": 95,
      "that": 96,
      "ce": 97,
      "gh": 98,
      "ent": 99,
      "ut": 100,
      "for": 101,
      "ver": 102,
      "im": 103,
      "so": 104,
      "ad": 105,
      "ay": 106,
      "ion": 107,
      "his": 108,
      "li": 109,
      "ir": 110,
      "her": 111,
      "ow": 112,
      "with": 113,
      "all": 114,
      "ri": 115,
      "ter": 116,
      "co": 117,
      "un": 118,
      "ght": 119,
      "ac": 120,
      "had": 121,
      "not": 122,
      "we": 123,
      "sa": 124,
      "su": 125,
      "but": 126,
      "lo": 127,
      "she": 128,
      "mo": 129,
      "ould": 130,
      "ke": 131,
      "ther": 132,
      "de": 133,
      "one": 134,
      "ne": 135,
      "ic": 136,
      "pe": 137,
      "him": 138,
      "ab": 139,
      "go": 140,
      "ur": 141,
      "are": 142,
      "out": 143,
      "ge": 144,
      "fe": 145,
      "ain": 146,
      "ere": 147,
      "po": 148,
      "sh": 149,
      "my": 150,
      "am": 151,
      "do": 152,
      "man": 153,
      "con": 154,
      "ess": 155,
      "if": 156,
      "they": 157,
      "up": 158,
      "have": 159,
      "whi": 160,
      "this": 161,
      "ti": 162,
      "us": 163,
      "oun": 164,
      "by": 165,
      "said": 166,
      "our": 167,
      "now": 168,
      "per": 169,
      "rom": 170,
      "qu": 171,
      "ct": 172,
      "ra": 173,
      "od": 174,
      "te": 175,
      "ard": 176,
      "ca": 177,
      "there": 178,
      "from": 179,
      "ex": 180,
      "il": 181,
      "which": 182,
      "ag": 183,
      "fo": 184,
      "res": 185,
      "ind": 186,
      "est": 187,
      "were": 188,
      "who": 189,
      "ul": 190,
      "thing": 191,
      "ok": 192,
      "ant": 193,
      "pl": 194,
      "what": 195,
      "very": 196,
      "ust": 197,
      "tr": 198,
      "ight": 199,
      "lf": 200,
      "com": 201,
      "ous": 202,
      "them": 203,
      "ation": 204,
      "der": 205,
      "some": 206,
      "would": 207,
      "when": 208,
      "art": 209,
      "ast": 210,
      "way": 211,
      "wor": 212,
      "et": 213,
      "will": 214,
      "wo": 215,
      "end": 216,
      "ong": 217,
      "ho": 218,
      "bo": 219,
      "ill": 220,
      "pp": 221,
      "see": 222,
      "fa": 223,
      "ound": 224,
      "ment": 225,
      "ate": 226,
      "ak": 227,
      "their": 228,
      "self": 229,
      "own": 230,
      "pr": 231,
      "red": 232,
      "itt": 233,
      "then": 234,
      "ist": 235,
      "af": 236,
      "ven": 237,
      "ough": 238,
      "other": 239,
      "been": 240,
      "can": 241,
      "ck": 242,
      "pro": 243,
      "ack": 244,
      "gre": 245,
      "any": 246,
      "your": 247,
      "la": 248,
      "could": 249,
      "ish": 250,
      "si": 251,
      "ple": 252,
      "know": 253,
      "fore": 254,
      "ity": 255
    },
    "merges": [
      "t h",
      "th e",
      "i n",
      "a n",
      "e r",
      "r e",
      "o u",
      "o n",
      "e d",
      "a t",
      "e n",
      "t o",
      "an d",
      "i s",
      "a s",
      "o f",
      "in g",
      "o r",
      "i t",
      "h e",
      "a r",
      "e s",
      "l l",
      "l e",
      "h a",
      "s e",
      "s t",
      "w h",
      "m e",
      "b e",
      "n o",
      "c h",
      "r o",
      "w i",
      "a l",
      "y ou",
      "w as",
      "i d",
      "l y",
      "l d",
      "v e",
      "th at",
      "c e",
      "g h",
      "en t",
      "u t",
      "f or",
      "v er",
      "i m",
      "s o",
      "a d",
      "a y",
      "i on",
      "h is",
      "l i",
      "i r",
      "h er",
      "o w",
      "wi th",
      "a ll",
      "r i",
      "t er",
      "c o",
      "u n",
      "gh t",
      "a c",
      "ha d",
      "no t",
      "w e",
      "s a",
      "s u",
      "b ut",
      "l o",
      "s he",
      "m o",
      "ou ld",
      "k e",
      "the r",
      "d e",
      "on e",
      "n e",
      "i c",
      "p e",
      "h im",
      "a b",
      "g o",
      "u r",
      "a re",
      "ou t",
      "g e",
      "f e",
      "a in",
      "er e",
      "p o",
      "s h",
      "m y",
      "a m",
      "d o",
      "m an",
      "c on",
      "es s",
      "i f",
      "the y",
      "u p",
      "ha ve",
      "wh i",
      "th is",
      "t i",
      "u s",
      "ou n",
      "b y",
      "sa id",
      "ou r",
      "no w",
      "p er",
      "ro m",
      "q u",
      "c t",
      "r a",
      "o d",
      "t e",
      "ar d",
      "c a",
      "the re",
      "f rom",
      "e x",
      "i l",
      "whi ch",
      "a g",
      "f o",
      "re s",
      "in d",
      "es t",
      "w ere",
      "wh o",
      "u l",
      "th ing",
      "o k",
      "an t",
      "p l",
      "wh at",
      "ver y",
      "u st",
      "t r",
      "i ght",
      "l f",
      "co m",
      "ou s",
      "the m",
      "at ion",
      "d er",
      "so me",
      "w ould",
      "wh en",
      "ar t",
      "as t",
      "w ay",
      "w or",
      "e t",
      "wi ll",
      "w o",
      "en d",
      "on g",
      "h o",
      "b o",
      "i ll",
      "p p",
      "se e",
      "f a",
      "oun d",
      "m ent",
      "at e",
      "a k",
      "the ir",
      "se lf",
      "ow n",
      "p r",
      "re d",
      "it t",
      "the n",
      "is t",
      "a f",
      "v en",
      "ou gh",
      "o ther",
      "be en",
      "c an",
      "c k",
      "p ro",
      "ac k",
      "g re",
      "an y",
      "you r",
      "l a",
      "c ould",
      "is h",
      "s i",
      "p le",
      "k now",
      "fo re",
      "it y"
    ]
  }
}